# Class - 4 Oct13,2019

** Revision **

In [2]:
import numpy as np
import pandas as pd

In [3]:
a = 10
b = 20

np.where(b>a , "Pass", "Fail")

array('Pass', dtype='<U4')

In [4]:
# you can use zip also instead of np.where.

In [7]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [8]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [9]:
frame = pd.DataFrame(data,columns = ['year', 'state' , 'pop'])
frame

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [12]:
frame = pd.DataFrame(data,columns = ['year', 'state' , 'pop'], index = [11,12,13,14,15])
frame

ValueError: Shape of passed values is (6, 3), indices imply (5, 3)

In [13]:
frame = pd.DataFrame(data,columns = ['year', 'state' , 'pop','extra'])
frame

   year   state  pop extra
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [14]:
frame = pd.DataFrame(data,columns = ['year', 'state' , 'pop','Debt'],index = ['one','two','three','four','five','six'])
frame

       year   state  pop Debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [16]:
frame.Debt = [1,2,3,4,5,6]
frame

       year   state  pop  Debt
one    2000    Ohio  1.5     1
two    2001    Ohio  1.7     2
three  2002    Ohio  3.6     3
four   2001  Nevada  2.4     4
five   2002  Nevada  2.9     5
six    2003  Nevada  3.2     6

In [19]:
frame.columns

Index(['year', 'state', 'pop', 'Debt'], dtype='object')

In [20]:
frame.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [22]:
frame.Debt

one      1
two      2
three    3
four     4
five     5
six      6
Name: Debt, dtype: int64

In [23]:
frame.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [24]:
frame['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [25]:
# if column name has space then do with []

In [26]:
#for row wise data uthana he

In [27]:
frame.loc['one']

year     2000
state    Ohio
pop       1.5
Debt        1
Name: one, dtype: object

In [29]:
frame.loc['one']['year']

2000

In [39]:
val = pd.Series([-1.2,-1.5,-1.7],index=['two','four','six'])
val

two    -1.2
four   -1.5
six    -1.7
dtype: float64

In [37]:
frame.Debt

one      NaN
two     -1.2
three    NaN
four    -1.5
five     NaN
six     -1.7
Name: Debt, dtype: float64

In [40]:
frame.Debt=val
frame

       year   state  pop  Debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9   NaN
six    2003  Nevada  3.2  -1.7

In [43]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
    'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [44]:
#jo kam hum columns n index k thru kr re thy ,now we can do with dictionary to dictionary

In [45]:
pd.DataFrame(pop , index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [49]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [48]:
pdata = {'Ohio' :frame3 ['Ohio'][:-1],    # (go to frame3 then do to ohio 0 till-1.-1 not included)
         'Nevada' :frame3['Nevada'][:2]}
pdata

{'Ohio': 2000    1.5
 2001    1.7
 Name: Ohio, dtype: float64, 'Nevada': 2000    NaN
 2001    2.4
 Name: Nevada, dtype: float64}

In [50]:
pdata = pd.DataFrame(pdata)
pdata

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [51]:
frame3.index.name = 'year'; frame3.columns.name = 'state' # to get it labelled of row n col
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [52]:
frame3.values # values array bn kr ainge frame mei se

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

## ESSENTIAL FUNCTIONALITY

** __ REindexing on series ** __

In [55]:
#Reindexing
obj = pd.Series([4.5,7.2,-5.3,3.6], index = ['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [57]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [58]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [60]:
obj3.reindex(range(6))

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [62]:
obj3.reindex(range(6), method = 'ffill')  # ffill is forward fill

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [63]:
obj3.reindex(range(6), method = 'bfill') #backward fill bfill

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

** __ Reindexing on frame ** __

In [64]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                    index=['a', 'c', 'd'],
                    columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [66]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [67]:
states = ['Texas', 'Utah', 'California']

In [68]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [70]:
frame2.reindex(columns=states)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [73]:
frame2.reindex(index =['f','b','a','d','c','g'], columns =['Texas','newyork' 'Utah', 'California','bay'] )

   Texas  newyorkUtah  California  bay
f    NaN          NaN         NaN  NaN
b    NaN          NaN         NaN  NaN
a    1.0          NaN         2.0  NaN
d    7.0          NaN         8.0  NaN
c    4.0          NaN         5.0  NaN
g    NaN          NaN         NaN  NaN

In [75]:
#making array using numpy
data = pd.DataFrame(np.arange(5),columns =['a'])
data

   a
0  0
1  1
2  2
3  3
4  4

In [82]:
data = pd.DataFrame(np.arange(1,16).reshape((3,5)),columns=['a','b','c','d','e'])
data

    a   b   c   d   e
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15

In [84]:
data = pd.DataFrame(np.arange(1,101).reshape((20,5)),columns=['a','b','c','d','e'])
data

     a   b   c   d    e
0    1   2   3   4    5
1    6   7   8   9   10
2   11  12  13  14   15
3   16  17  18  19   20
4   21  22  23  24   25
5   26  27  28  29   30
6   31  32  33  34   35
7   36  37  38  39   40
8   41  42  43  44   45
9   46  47  48  49   50
10  51  52  53  54   55
11  56  57  58  59   60
12  61  62  63  64   65
13  66  67  68  69   70
14  71  72  73  74   75
15  76  77  78  79   80
16  81  82  83  84   85
17  86  87  88  89   90
18  91  92  93  94   95
19  96  97  98  99  100

In [85]:
data = pd.DataFrame(np.arange(1,101).reshape((20,5)),columns=['a','b','c','d','e'] , index = range(1,101,5))
data

     a   b   c   d    e
1    1   2   3   4    5
6    6   7   8   9   10
11  11  12  13  14   15
16  16  17  18  19   20
21  21  22  23  24   25
26  26  27  28  29   30
31  31  32  33  34   35
36  36  37  38  39   40
41  41  42  43  44   45
46  46  47  48  49   50
51  51  52  53  54   55
56  56  57  58  59   60
61  61  62  63  64   65
66  66  67  68  69   70
71  71  72  73  74   75
76  76  77  78  79   80
81  81  82  83  84   85
86  86  87  88  89   90
91  91  92  93  94   95
96  96  97  98  99  100

In [86]:
data = pd.DataFrame(np.arange(1,101).reshape((20,5)),columns=['a','b','c','d','e'] , index = range(1,102,5))
data # means text ki length same honi chahean

ValueError: Shape of passed values is (20, 5), indices imply (21, 5)

In [87]:
# can do with lists
data = pd.DataFrame(np.arange(1,101).reshape((20,5)),columns=list('abcde'), index = range(1,101,5))
data

     a   b   c   d    e
1    1   2   3   4    5
6    6   7   8   9   10
11  11  12  13  14   15
16  16  17  18  19   20
21  21  22  23  24   25
26  26  27  28  29   30
31  31  32  33  34   35
36  36  37  38  39   40
41  41  42  43  44   45
46  46  47  48  49   50
51  51  52  53  54   55
56  56  57  58  59   60
61  61  62  63  64   65
66  66  67  68  69   70
71  71  72  73  74   75
76  76  77  78  79   80
81  81  82  83  84   85
86  86  87  88  89   90
91  91  92  93  94   95
96  96  97  98  99  100

In [88]:
list('abcde')

['a', 'b', 'c', 'd', 'e']

In [90]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [91]:
# get index vakue from thosands of data
frame2.loc['c']

Ohio          3.0
Texas         4.0
California    5.0
Name: c, dtype: float64

In [92]:
frame2.loc['c']['California']

5.0

In [94]:
frame2.loc['c'][2]

5.0

In [95]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [96]:
frame2.loc[::-1]

   Ohio  Texas  California
d   6.0    7.0         8.0
c   3.0    4.0         5.0
b   NaN    NaN         NaN
a   0.0    1.0         2.0

In [98]:
frame2.loc[::-1,::-1]

   California  Texas  Ohio
d         8.0    7.0   6.0
c         5.0    4.0   3.0
b         NaN    NaN   NaN
a         2.0    1.0   0.0

In [99]:
# loc n iloc diff ..iloc last value return nhi krta he ,loc krta he
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [100]:
frame2.loc['a':'c']

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0

In [101]:
frame2.iloc[0:2]

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN

In [104]:
frame2.iloc[0:3]

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0

In [105]:
frame2.loc['b']['Ohio'] = 2
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   2.0    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [171]:
# can give name or index number
frame2.loc['b'][0] = 2
frame2

   Ohio  Texas  California
a   4.0    6.0         2.0
b   2.0    6.0         4.0
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [170]:
#to update more values of col
frame2.loc['a'][:2] = [4,6]
frame2

   Ohio  Texas  California
a   4.0    6.0         2.0
b   4.0    6.0         4.0
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [111]:
frame2.loc['b'][[0,2]] = [4,6]
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   4.0    6.0         6.0
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [113]:
del frame2[0]

KeyError: 0

In [114]:
frame2.loc['b'][0]

4.0

In [115]:
frame2.loc['b']

Ohio          4.0
Texas         6.0
California    6.0
Name: b, dtype: float64

In [116]:
# 0 ka 2 n 2 ka 0 pe
frame2.loc['b'][[0,2]]

Ohio          4.0
California    6.0
Name: b, dtype: float64

In [123]:
frame2.loc['b'][[2,0]] = frame2.loc['b'][[0,2]]
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   6.0    6.0         4.0
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [ ]:
#page number read

In [124]:
frame2['Texas'][1] +5

11.0

In [125]:
#if nan hoti value then add krte tu nan hi aeyga

In [126]:
frame4 = frame2.copy()
frame4

   Ohio  Texas  California
a   0.0    1.0         2.0
b   6.0    6.0         4.0
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [128]:
frame4['std'] = [4,5,6,7]
frame4

   Ohio  Texas  California  std
a   0.0    1.0         2.0    4
b   6.0    6.0         4.0    5
c   3.0    4.0         5.0    6
d   6.0    7.0         8.0    7

In [129]:
frame2 +frame4

   California  Ohio  Texas  std
a         4.0   0.0    2.0  NaN
b         8.0  12.0   12.0  NaN
c        10.0   6.0    8.0  NaN
d        16.0  12.0   14.0  NaN

In [130]:
frame2 - frame4

   California  Ohio  Texas  std
a         0.0   0.0    0.0  NaN
b         0.0   0.0    0.0  NaN
c         0.0   0.0    0.0  NaN
d         0.0   0.0    0.0  NaN

In [131]:
frame2.loc[:]

   Ohio  Texas  California
a   0.0    1.0         2.0
b   6.0    6.0         4.0
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [132]:
frame2.loc['b':]

   Ohio  Texas  California
b   6.0    6.0         4.0
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [133]:
frame2.loc[:'d':2]

   Ohio  Texas  California
a   0.0    1.0         2.0
c   3.0    4.0         5.0

In [134]:
frame2.loc[:'d':-1]

   Ohio  Texas  California
d   6.0    7.0         8.0

In [135]:
frame2.loc['a':'d':-1]   a start n a se kuch kuch nhi tha

Empty DataFrame
Columns: [Ohio, Texas, California]
Index: []

In [138]:
frame2.loc['d'::-1]

   Ohio  Texas  California
d   6.0    7.0         8.0
c   3.0    4.0         5.0
b   6.0    6.0         4.0
a   0.0    1.0         2.0

In [140]:
#in deeceniding order
frame2.loc['d'::1,['Ohio']]

   Ohio
d   6.0

In [141]:
frame2.loc[::1,['Ohio']]

   Ohio
a   0.0
b   6.0
c   3.0
d   6.0

In [142]:
frame2.loc[::-1,['Ohio']]

   Ohio
d   6.0
c   3.0
b   6.0
a   0.0

In [144]:
#col last wala start me ae
frame2.loc[::-1][:]

   Ohio  Texas  California
d   6.0    7.0         8.0
c   3.0    4.0         5.0
b   6.0    6.0         4.0
a   0.0    1.0         2.0

In [145]:
frame2.loc[::-1]['Texas':]

Empty DataFrame
Columns: [Ohio, Texas, California]
Index: []

In [148]:
frame2.loc[::-1,'Texas']

d    7.0
c    4.0
b    6.0
a    1.0
Name: Texas, dtype: float64

In [149]:
frame2.loc[::-1,'Texas'::-1]

   Texas  Ohio
d    7.0   6.0
c    4.0   3.0
b    6.0   6.0
a    1.0   0.0

In [150]:
frame2.loc[::1,'California'::-1]

   California  Texas  Ohio
a         2.0    1.0   0.0
b         4.0    6.0   6.0
c         5.0    4.0   3.0
d         8.0    7.0   6.0

In [151]:
frame2.loc[::1,::-1]

   California  Texas  Ohio
a         2.0    1.0   0.0
b         4.0    6.0   6.0
c         5.0    4.0   3.0
d         8.0    7.0   6.0

In [154]:
frame2.loc['b'][0] =3
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   3.0    6.0         4.0
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [155]:
frame2.loc['b'][0] =3
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   3.0    6.0         4.0
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [156]:
frame4

   Ohio  Texas  California  std
a   0.0    1.0         2.0    4
b   6.0    6.0         4.0    5
c   3.0    4.0         5.0    6
d   6.0    7.0         8.0    7

In [157]:
abs(-3)

3

In [158]:
abs(3)

3

In [159]:
frame.isna()

    Ohio  Texas  California
a  False  False       False
b  False  False       False
c  False  False       False
d  False  False       False

In [160]:
frame4[frame4 >5]

   Ohio  Texas  California  std
a   NaN    NaN         NaN  NaN
b   6.0    6.0         NaN  NaN
c   NaN    NaN         NaN  6.0
d   6.0    7.0         8.0  7.0

In [161]:
#kahan nan he
frame4[frame4.isna()]

   Ohio  Texas  California  std
a   NaN    NaN         NaN  NaN
b   NaN    NaN         NaN  NaN
c   NaN    NaN         NaN  NaN
d   NaN    NaN         NaN  NaN

In [163]:
frame4.isnull()

    Ohio  Texas  California    std
a  False  False       False  False
b  False  False       False  False
c  False  False       False  False
d  False  False       False  False

In [167]:
frame4.fillna(0) # jahan nan tha wahan 0 jahan nan vakues  hoti hen wahan kuch tu dalna he..preder 0..wrna galat baat.better is to give avearge

   Ohio  Texas  California  std
a   0.0    1.0         2.0    4
b   6.0    6.0         4.0    5
c   3.0    4.0         5.0    6
d   6.0    7.0         8.0    7

In [165]:
frame4.fillna(0,inplace = True) #inplace memory mei update krega

In [166]:
frame4

   Ohio  Texas  California  std
a   0.0    1.0         2.0    4
b   6.0    6.0         4.0    5
c   3.0    4.0         5.0    6
d   6.0    7.0         8.0    7

In [172]:
dropna

NameError: name 'dropna' is not defined